app/controllers/sites_controller.rb

  def index
    @site = Site.new
    @sites = Site.all
---
SELECT "sites".* FROM "sites"

  def create
    Site.create params[:site]
---
INSERT INTO "sites" ("created_at", "updated_at", "url") VALUES (?, ?, ?)  [["created_at", Sun, 20 May 2012 04:57:07 UTC +00:00], ["updated_at", Sun, 20 May 2012 04:57:07 UTC +00:00], ["url", nil]]

  def destroy
    Site.destroy params[:id]
---
DELETE FROM "sites" WHERE "sites"."id" = ?  [["id", 1]]